[
{"title": "\n\t\t\t\n    N.C. A&T Academic Degree Programs. Majors, Minors and Certifications  | North Carolina A&T State University\n\t\t", "content": "Skip To Main Site Navigation Skip to Content Skip To Left Navigation Skip To Footer search close menu close Visit Apply Give search Search High Contrast: HIGH CONTRAST ON OFF Academics Majors, Minors & Programs Colleges & Departments Academic Resources A&T Online Graduate Programs Transfer Students Honors College Continuing Education Summer Sessions International Affairs and Programs Office of the Provost Accreditation Admissions Undergraduate Admissions Graduate Admissions Readmission Professional Programs Cost to Attend Financial Aid Apply Now Research Undergraduate Research Economic Development Technology Transfer Research Centers & Institutes Life Sciences Public Information Research News Campus Life Explore Our Campus Housing Sports & Fitness Arts & Culture Student Activities Aggie Student Wellness Student Safety Campus Enterprises Student Affairs University Events Calendar 1891Connect Events Calendar Athletics N.C. A&T Athletics Campus Recreation Center Intramural Sports and Clubs About Initiatives Accreditation Facts and Points of Pride Rankings & Recognition A&T History Leadership Jobs Division of Human Resources Strategic Partnerships and Economic Development University Relations Aggie Newsroom Visit Apply Give High Contrast Mobile: HIGH CONTRAST ON OFF Info For Current Students Faculty & Staff Alumni Parents & Families Community Quicklinks AGGIE HUB Aggie Access Online Aggie Help Blackboard Employee Directory Employee Email Student Email Getting Information Administrative Offices Financial Aid Directions & Parking Bluford Library Employment Opportunities ´ Filter Programs Degree Offerings: Degree Offerings Undergraduate Graduate Minors Certificate Location: Location On Campus Online Home Academics Majors, Minors and Programs N.C. A&T Academic Degree Programs Majors, Minors and Certifications offered at North Carolina A&T State University There are a multitude of opportunities for you to learn and grow at North Carolina A&T -- 58 undergraduate degree programs, 18 minors, 13 doctoral degree programs, 36 master's programs and 41 graduate certificate programs. Students seeking intellectual stimulation and growth, critical thinkers seeking research opportunities, travelers at heart looking to learn abroad and future citizens of the world who want to serve humankind will find undergraduate and graduate degree programs, offered both in the classroom and online, that will help them fulfill their dreams. Certificate programs and continuing education opportunities are available in a wide range of areas, as well. Search Programs: Search Programs Reset College of Business and Economics Accounting Bachelor of Sciences (BS) Accounting, Master of Business Administration (MBA) Accounting | The Department of Accounting and Finance has a rich legacy of educating business professionals with a strong comprehension of accounting. We were the first accounting program at a Historically Black College or University to receive the prestigious accreditation of AACSB International. Our is one of the nation's largest programs in production of African American CPAs. And we have just launched a Master of Accountancy program that will add a rich, new dimension to our college. Quick Info An Accounting degree from A&T can take you far: Each year, Big Four accounting firms, national and regional accounting firms, Fortune 500 service companies, industrial firms and large governmental agencies recruit our majors. MBA Accounting Concentration BS Accounting Minor in Accounting College of Education Adult Education Master of Sciences (MS) Adult Education | The graduate program in Adult Education is highly regarded both in North Carolina and nationally. The M.S. in Adult Education prepares education professionals for leadership careers. Quick Info Graduates of the Adult Education program go on to careers in higher education, busines and for-profit and non-profit organizations, as well as top doctoral programs. Leadership Studies graduates have attained positions as college presidents and deans and senior leaders of programs in health, non-profit and business organizations. View Program Page College of Agriculture and Environmental Sciences Advanced Certification in Family and Consumer Sciences This program is for you if you are looking for a strong teaching foundation in areas including classroom management, curriculum development, teaching methods, assessment, education technology and content in family and consumer sciences. QUICK INFO Our graduates work as teachers at the middle and high school levels. The certificate is especially designed for teachers who are committed to preparing students for family life, work life or for careers in family and consumer sciences. View Program Page Online Certification Joint School of Nanoscience and Nanoengineering Advanced Materials Program Type: Post-Baccalaureate Certificate This certificate program trains and educates students in concepts related to the design of advanced materials, understanding their physical, mechanical, chemical, and structural properties. The knowledge needed to correlate these properties to their function, given that advanced materials and nanotechnology are interwoven nowadays. The education and training gained by the students will provide them with the skills needed to acquire employment opportunities in various industries, including medical, healthcare, pharmaceutical, electronics, automotive, and aerospace industries. It will also prepare them for careers in government agencies and advanced graduate studies in science, technology, and engineering. View Program Information College of Agriculture and Environmental Sciences Advanced Waste Management Certificate The advanced interdisciplinary waste management certificate program is open to all graduate students. It is designed to create a talented pool of advanced students who will become leaders in environmental and waste management fields. View More Info College of Agriculture and Environmental Sciences Agricultural and Environmental Sciences PhD | The Ph.D. in agricultural and environmental sciences program at N.C. A&T teaches students about the complexities of our global food system and how to adapt to emerging challenges around food, energy and water. This program prepares individuals for successful careers as researchers, faculty and entrepreneurs and to be active and effective leaders in academia and the agriculture industry in both the public and private sectors. Quick Info Our doctoral graduates will confront the grand challenges of providing and sustaining a safe and healthy supply of food, fiber and other products for a burgeoning global population. View Program Page College of Agriculture and Environmental Sciences Agricultural and Environmental Systems Bachelor of Sciences (BS) Agricultural and Environmental Systems, Master of Sciences (MS) Agricultural and Environmental Systems | The B.S. in Agricultural and Environmental Systems will give you a solid immersion in all of the current and emerging issues facing food and agribusiness firms, as well as the knowledge and skills necessary to work expertly in the range of business areas within companies and operations in those industries. Quick Info Graduates are ready for entry-level positions in areas ranging from agricultural chemical to commodity merchandising to soil conversation. You will also be well-prepared to pursue a graduate degree in range of programs, most popularly the M.S. in Agricultural and Environmental Systems, with a concentration in Agribusiness and Food Industry Management. View Program Page College of Agriculture and Environmental Sciences Agricultural Education Bachelor of Sciences (BS) Agricultural Education, Master of Sciences (MS) Agricultural Education | Few challenges are as great and growing as feeding our hungry planet and safeguarding our natural resources. The need for professionals who can teach and communicate about agrisciences to students, agribusiness professionals and the agricultural community looms large and represents a significant opportunity for students interested in this field. Quick Info With a degree in Agricultural Education, you will be well prepared for a rewarding teaching career in a broad range of settings, as well as pursuit of a graduate degree in this or related fields. BS Agricultural Education Online Degree MS Agricultural Education Online Degree College of Agriculture and Environmental Sciences Animal Science Bachelor of Sciences (BS) Animal Science | The Department of Animal Sciences is home to one of A&T's top STEM program and is the nation's top producer of Animal Sciences degrees earned by African Americans. As a student, you'll receive first-class advising and instruction and get hands-on experience in research and on the University Farm. Quick Info Animal Sciences serve the biggest industry in the world. Our graduates go on to veterinary medicine, business and marketing professions serving animal industries, biotechnology, biomedical and pharmaceutical industries, product management and much more. View Program Page College of Science and Technology Applied Engineering Technology Bachelor of Sciences (BS) Applied Engineering Technology | The department offers four undergraduate and graduate degree STEM programs, all of which focus on critical thinking and strong preparation of students for immediate impact in their careers. QUICK INFO Graduates of our programs are in extraordinarily high demand and are working for such major concerns as 3M, Bank of America, John Deere, Lockheed Martin, Pratt & Whitney, Volvo, Xerox and many more. Join us and start your journey toward career success in one of many exciting applied technology fields. View Program Page College of Science and Technology Applied Mathematics Master of Sciences (MS) Applied Mathematics | North Carolina A&T is the nation's top producer of African American master's degree earners in Mathematics and Statistics. Applied Mathematics is a leading graduate program at our university, highly regarded for the quality of students it attracts and the career possibilities that await them upon graduation. QUICK INFO In the age of big data and storehouses of electronic information, the demand for Applied Mathematics graduates is exceptionally strong. Between 2014 and 2024, job growth of 24 percent is forecast, much higher than many other professions. View Program Page College of Science and Technology Applied Science and Technology PhD | You will get an exceptional grounding in the technical and leadership skills in high demand in the marketplace with a doctoral degree in Applied Science and Technology. Best of all, you can choose from one of six different concentrations that map to your interests and career goals: Bioscience, Applied Chemistry, Applied Physics, Data Sciences and Analytics, Information Technology and Technology Management, and Atmoepheric, Environmental and Energy Science. QUICK INFO Career prospects are strong for our graduates: Environmental scientists, for instance, enjoy an average salary of $97,000 a year. Earnings potential in other areas can run even higher. View Program Page College of Science and Technology Atmospheric Sciences and Meteorology Bachelor of Sciences (BS) Atmospheric Sciences and Meteorology | As the world's climate changes, the demand for individuals with the education and training to understand our atmosphere and the factors that shape it is growing. A degree in Atmospheric Sciences and Meteorology will prepare you for impact in this area through coursework and internships in the use of data from surface air stations, satellites, radar and more. You'll learn to predict weather, flooding, air pollution and impacts of climate change. QUICK INFO Our graduates are well prepared for graduate studies or careers with the National Weather Service, federal agencies like NASA, NOAA and the EPA, academic\\a and the weather service industry. View Program Page College of Science and Technology Automotive Engineering Technology Bachelor of Sciences (BS) Automotive Engineering Technology | The Automotive Engineering Technology program prepares you to apply basic engineering principles and technical skills in developing, manufacturing, and testing self-propelled vehicles and their systems. QUICK INFO Our students graduate with a strong working knowledge of automotive principles, mobility design, performance modeling and testing, and mechanical fundamentals. They also have a keen understanding of the interdisciplinary intersection of technology, engineering, management, marketing, graphic design, communications and more. View Program Page College of Engineering Bioengineering Bachelor of Sciences (BS) Bioengineering, Master of Sciences (MS) Bioengineering | Bioengineering is the application of engineering principles and techniques to problems in medicine and healthcare. Bioengineering seeks to close the gap between engineering and medicine. It is responsible for innovations like prosthetics that restore limb function, implanted stimulators that restore heart function and biomaterials for tissue regeneration. Quick Info With a degree in Bionengineering, you'll be well prepared to enter the research and development work that characterizes this field, taking on exciting challenges and working toward solutions that might have been unthinkable 25 years ago. View Program Page College of Agriculture and Environmental Sciences Biological Engineering Bachelor of Sciences (BS) Biological Engineering | Biological Engineering is one of the most exciting fields of study today. It integrates engineering with biological, agricultural and environmental sciences for the sustainable production of food and biomaterials and the efficient use of natural resources. QUICK INFO Most biomedical engineers work in manufacturing, universities, hospitals and research facilities of companies and educational and medical institutions. Graduates can expect attractive starting salaries and significant salary growth over their careers. View Program Page College of Science and Technology Biology Bachelor of Sciences (BS) Biology, Master of Sciences (MS) Biology, Master of Arts in Teaching (MAT) Biology | An undergraduate or graduate degree in Biology will prepare you for a lifetime of impact in this natural sciences discipline. Rich with opportunity and specialization areas, Biology makes possible careers in a diverse range of high-demand fields. QUICK INFO Entry-level salaries for biologists with both undergraduate and graduate degrees are significant, and the opportunity for salary growth over the course of your career is sizable. View Program Page College of Science and Technology Built Environment Bachelor of Sciences (BS) Built Environment | The three degree programs prepare graduates for careers in construction management, field engineering, project management, geomatics, surveying, environmental health and safety management, to name a few. The program staff in CM/EHS/GEOM will assist you in finding a specific major based on your career interests and personal characteristics. QUICK INFO The Bachelor of Science degree programs offered by the department are construction management, environmental health and safety and geomatics. All of our degree programs in the Department of Built Environment have 80-90 percent placement of its graduates. View Program Page College of Business and Economics Business Administration Master of Business Administration (MBA) Business Administration | Our master’s program in business administration (MBA) provides students with a thorough understanding of business basics including economics finance and management. Scholars have the opportunity to focus on one of four concentrations: accounting, human resource management, supply chain management or general. The latter three concentrations are also available in our Online MBA program. QUICK INFO Our program is well-positioned to prepare managers for the global and competitive landscape in any placement they may find themselves by cultivating transferrable skills they can contribute to the marketplace. View Program Page Online Degree View Program Page College of Business and Economics Business Analytics Bachelor of Sciences (BS) Business Analytics | B.S. - Business Analytics (BA) degree The BA degree has been developed based on the Business Roundtable Workforce Partnership Initiative (WPI) of North Carolina's list of knowledge and skills areas, and offers a much-desired skill set that employers are seeking in graduates.The BA graduates are trained in the complete analytics lifecycle to gather, clean, analyze, visualize, and present existing data to help inform business decisions. Courses cover descriptive, diagnostics, predictive, and prescriptive analytics. QUICK INFO Graduates can use data to answer a question and empower decision makers to plot the best course of action. Their business knowledge allows them to work with business leaders and stakeholders to define a problem or business need. Their technical knowledge enables them to identify sources of data, clean and prepare data; analyze data using various models, visualize it, and then tell a compelling story of the analyses. View Program Page College of Business and Economics Business Information Technology Bachelor of Sciences (BS) Business Information Technology | The Bachelor of Science in Business Information Technology provides you with a strong business foundation requiring the same accounting, economics, management, and marketing courses required by all majors in the College of Business and Economics. As an Information Technology student, you will also enroll in courses such as advanced computer applications, business information systems, and management technology. Quick Info What sets the Business Information Technology degree apart from most others is that you can tailor your degree to meet your specific career goals. You can pick and choose the IT classes that you are most interested in taking, such as e-commerce, web design, and Internet security, just to name a few. View Program Page Online Degree College of Engineering Chemical Engineering Bachelor of Sciences (BS) Chemical Engineering, Master of Sciences (MS) Chemical Engineering | Students in our undergraduate and masters Chemical Engineering programs develop a keen understanding of processes and equipment in which material changes in composition or state. As graduates, they are in high demand for companies that manufacture plastics, forest products, gasoline, food, textile fibers, pharmaceuticals, microelectronic devices and more. QUICK INFO A career in Chemical Engineering is often a route to top management. In view of the many options open to its graduates, Chemical Engineering can be a particularly good choice for students who have broad interests, but have not yet defined their career objectives. View Program Page College of Science and Technology Chemistry Bachelor of Sciences (BS) Chemistry, Master of Sciences (MS) Chemistry | Chemistry is often referred to as the “central science” because it connects the physical, life and applied sciences. A degree in chemistry can take you anywhere you want to go. Students interested in a research career will find that their Chemistry foundation allows them to branch into other fields of study at the graduate level or focus on a specific area of chemistry that grabs their interest. Quick Info As a student, you'll encounter smart classrooms, excellent laboratory facilities and opportunities to work with our oustanding faculty in research projects, all of which support an educational experience that will pay major dividends over your career. View Program Page College of Agriculture and Environmental Sciences Child Development and Family Studies Bachelor of Sciences (BS) Child Development and Family Studies | The Child Development and Family Studies Program will prepare you for a career focused on children, youth and families from diverse cultural, ethnic and linguistic backgrounds and abilities. Our thorough coursework includes lifespan human development, family studies, sociology, social work, elementary and special education, psychology, speech and health and physical education. QUICK INFO WIth your degree, you will be well prepared to enter such fields as family life and parent education, infant, toddler, preschool and kindergarten teaching, youth and Head Start leadership, family services, family dispute mediation and much more. View Program Page College of Engineering Civil, Architectural and Environmental Engineering Bachelor of Sciences (BS) Civil, Architectural and Environmental Engineering, Master of Sciences (MS) Civil, Architectural and Environmental Engineering | Whether you're interested in Civil Engineering or Architectural Engineering, we have the undergraduate that not only is right for you, but that will provide exceptional preparation that will enable you to excel in your career. On Campus | Online Quick Info Civil engineers create, operate and maintain public infrastructure like bridges, transportation systems, buildings, harbors and more. Erchitectural engineers create and maintain the numerous structural, heating/air conditioning, lighting/electrical, plumbing and fire protection systems for buildings. Click the link below to learn more about which may be right for you. BS Architectural Engineering BS Civil Engineering MS Civil Engineering College of Engineering Computational Data Science and Engineering Master of Sciences (MS) Computational Data Science and Engineering, PhD | Our undergraduate, masters and Ph.D. programs educate future leaders in the creation of knowledge, science and technology. They are prepared for careers of impact in a field that is bright with possibilities for generations to come. QUICK INFO Our students acquire a wide range of computational skills that will allow them to solve large-scale data-intensive and real-life problems. These skills are prized by employers, and our graduates have embarked at careers in Fortune 100 companies, governmental laboratories and prestigious universities, among other top concerns. MS Data Science and Engineering Online Degree Ph.D Data Science and Engineering College of Engineering Computer Engineering Bachelor of Sciences (BS) Computer Engineering | Computer engineering incorporates hardware and software in the electronic devices and systems that are increasingly part of every aspect of our lives. Computer engineers work in such areas as cybersecurity, networking, design automation, machine intelligence, software, the Internet of Things and much more. QUICK INFO As a computer engineer, you'll be able to work in a wide variety of careers, from industrial engineering to web development to computer network architect and many others. Growth prospects for this field are strong and will be, generations into the future. View Program Page College of Engineering Computer Science Bachelor of Sciences (BS) Computer Science, Master of Sciences (MS) Computer Science, PhD | Our Computer Science program offers cutting-edge instruction and the ability to participate in faculty-led, federally funded research. Agencies our students and faculty work with include NASA, the U.S. Air Force, the National Security Agency, the Naval Oceanographic Office and the National Science Foundation. QUICK INFO The demand for computer scientists today is enormous and growing, according the U.S. Bureau of Labor Statistics, which ranks job prospects in this field tops. Global reliance on computer technology means that trend is unlikey to change for generations to come. View Program Page Online Degree College of Science and Technology Construction Management Bachelor of Sciences (BS) Construction Management | Construction Management explores the management of people, processes and materials. Core courses focus on measurement and estimating, project management, contracts administration, cost management, law, construction structures, building information modeling, residential and commercial construction and communication. QUICK INFO Construction Management graduates enter the industry as estimators, planners, schedulers, project managers, quantity surveyors, contract administrators or building surveyors. Companies that hire our graduates include Turner Construction, Fluor, Bovis Lend Lease and Hensel Phelps, just to name a few. View Program Page College of Education Counselor Education and Supervision PhD | The doctoral program is designed to prepare culturally competent students and place major emphasis in the area of Trauma and Trauma-informed care. We are accredited by the Council for Accreditation of Counseling and Related Educational Programs (CACREP). QUICK INFO Our graduates experience a 100 percent post-graduation placement as rehabilitation and counselor education faculty, clinicians, researchers, counseling program coordinators, and leaders of state/federal agencies. View Program Page College of Arts, Humanities and Social Sciences Criminal Justice Bachelor of Sciences (BS) Criminal Justice | The Department of Criminal Justice educates students about criminology and the criminal justice system and prepare them for careers in government and the private sector, as well as advanced studies in areas such as law. QUICK INFO With a criminal justice degree, you can go on to a career in law enforcement, forensic crime scene investigation and criminal justice. We also offer a certificate program in forensic science, which is one of the most popular areas of study in the country. View Program Page Online Degree College of Engineering Cybersecurity Master of Sciences (MS) Cybersecurity | The online Master of Science in Cybersecurity (MSCYBR) degree program at North Carolina A&T State University – American’s largest HBCU – is designed to provide working professionals from multiple disciplines and industries with an understanding of and expertise in the core aspects of cybersecurity. Asynchronous online classes provide scheduling flexibility for distance learners. Students completing this program will be able to: The Certificate in Cybersecurity is available to all undergraduate students who currently enroll in a degree program at North Carolina A&T State University and has a GPA of 2.5 or above. Master of Science in Cybersecurity Post-Baccalaureate Certificate in Cybersecurity College of Science and Technology Post-Baccalaureate Certificate in Data Analytics This certificate is available only as an online program. Post-Baccalaurate Certificate in Data Analytics Online Degree College of Engineering Post-Baccalaureate Certificate in Data-Driven Modeling and Analysis of Complex Systems The Post-Baccalaureate Certificate Program in Data-Driven Modeling and Analysis of Complex Systems (DMACS) is designed to meet the growing demand for data-driven modelers and analysts. The DMACS program provides the training needed to capture, analyze, and visualize large-scale datasets for data-driven decision-making. View Program Page Online Certificate View More Info College of Business and Economics Economics Bachelor of Sciences (BS) Economics | Economics is one of the hottest career fields today, and our undergraduate program will give you strong preparation for success in this exciting field. We offer both an on-campus program and the state's only online B.S. in Economics. QUICK INFO Our graduates go on to high-earning careers in both public and private concerns. As the most popular of A&T degrees for graduates going on to law school, we are also well represented at law firms around the country. View Program Page Online Degree College of Engineering Electrical Engineering Bachelor of Sciences (BS) Electrical Engineering, Master of Sciences (MS) Electrical Engineering | Electrical engineering changed the way we live and communicate in the last century. Electrical engineers design many of the systems that we use every day, including the electrical power grid, communications satellites, computer systems, cell phones, medical devices and much, much more. QUICK INFO As an electrical engineering student, you'll learn to use engineering principles to design new and better electronics, solve real-world challenges and improve our quality of life. You can also expect attractive entry-level salaries upon graduation and an excellent lifetime earnings potential. BS Electrical Engineering MS Electrical Engineering Online View Program Page College of Science and Technology Electronics Technology Bachelor of Sciences (BS) Electronics Technology | A degree in Electronics Technology will prepare you to understand the science (application, design, installation and manufacturing) involved in the interface of various computer and electrical systems. Engineering technology includes a diverse range of sub-disciplines, including applied design, electronics, embedded systems, control systems, instrumentation, telecommunications and power systems. QUICK INFO Graduates of our Electronics Technology program are prepared to pursue a range of positions, including civil engineering technician, biomedical electronic technician, electronics technician for radar and more. B.S., Electronic Technology B.S., Electronics Technology Degree Online Electronics Technology Minor College of Education Elementary Education and Special Education Bachelor of Sciences (BS) Elementary Education and Special Education, Master of Arts in Teaching (MAT) Elementary Education and Special Education, Master of Arts in Education (MAED) Elementary Education and Special Education | The Department of Educator Preparation offers bachelor of science degrees in Elementary Education and Elementary Education/Special Education with dual licensure. For those interested in expanding their education, the department also offers a master of arts in teaching in Elementary Education and in Special Education (K-12), as well as a masters in education in Elementary Education (K-6) (The MAT in Elementary Education option only is available online). Quick Info High-quality teaching professionals are in high demand in today's schools, and our educator preparation programs will provide the education and knowledge you need not only to succeed, but to thrive in the demanding career of teaching. View Program Page MAT Elementary Education Online Concentration MAT Special Education Online Concentration College of Arts, Humanities and Social Sciences English Bachelor of Arts (BA) English, Master of Arts (MA) English, Master of Arts in Teaching (MAT) English | A passion for literature, a love for language, an interest in writing and communication -- all can lay the foundation for a degree in English, and that degree can lead you to virtually unlimited studies and careers. The Department of English's undergraduate majors and minors and two master's degrees give you a wide range of choice and flexibility to determine the focus best for you. Quick Info The rich culture of the English department includes concentrations ranging from African American Literature to Technical Writing, examinations of topics including film, science fiction and hip-hop and spoken word performances. Discover the possibilities that English holds for you. View Program Page College of Arts, Humanities and Social Sciences English and African American Literature Master of Arts (MA) English and African American Literature | This master's program will prepare you to teach at the secondary and college level, as well as doctoral level studies in African American literature, Africana, Cultural, Ethnic and Women's Studies, English, Education and more. QUICK INFO North Carolina A&T is the only historically black university that offers a master's in English at an affordable cost, requiring 30 credit hours and providing both thesis and non-thesis options. Our program is solidly grounded in African American literacy, rhetorical and literary practices. College of Science and Technology Environmental Health and Safety Bachelor of Sciences (BS) Environmental Health and Safety | Environmental Health and Safety (EHS) is a cutting-edge program concerned with the anticipation, recognition, evaluation and control of occupational safety and health hazards associated with mechanical/electrical systems, material handling, and chemical/biological processes, and it illustrates controls through engineering, administrative or personal protective measures. We are accredited by the Applied and Natural Science Accreditation Commission of ABET. The program is also a Qualified Academic Program (QAP). Graduates of a QAP are eligible to apply for the Graduate Safety Practitioner® (GSP®) . QUICK INFO Our graduates pursue industry careers as safety and health specialists, EPA specialists, risk managers, corporate industrial hygienists and compliance specialists, to name just a few. View Program Page Online Degree College of Education Family and Consumer Science Bachelor of Sciences (BS) Family and Consumer Science, Master of Arts in Teaching (MAT) Family and Consumer Science | N.C A&T's degrees and advanced online certification program in Family and Consumer Science bring an interdisciplinary focus on consumerism and the marketplace with an overriding goal: Helping individuals and families lead satisfying lives. Coursework ranges from nutrition to family financial planning and many points in between. Family and Consumer Science (The MAT option only is available online). QUICK INFO Whether you are interested in classroom teaching at the middle or high school level, working in the fashion industry, focusing on family financial management or delving into a related field, Family and Consumer Science can open the door to rewarding, lifetime careers. View Program Page Online Certificate Online MAT FCS Concentration College of Agriculture and Environmental Sciences Family Financial Planning A certificate in Family Financial Planning prepares students for careers as financial planners, investment advisors and wealth managers. Financial planners offer families and individuals the advice they need to make their money work for them. Students take online courses in financial planning, insurance planning, income tax planning, investment planning, estate planning and retirement planning, as well as a capstone course to provide real-world applications, all with a focus on families and individuals. View More Info College of Business and Economics Finance Bachelor of Sciences (BS) Finance | The bachelor's degree in finance is an essential credential for entry into the career marketplace of the financial industry. The degree can lead to professional certification and career success for you as an aspiring finance professional. Quick Info Careers in finance include commercial and investment banking, financial planning, public accounting, real estate agent, insurance agent and more. They are typically financially rewarding and offer significant opportunities for advancement. View Program Page College of Agriculture and Environmental Sciences Food and Nutritional Sciences Bachelor of Sciences (BS) Food and Nutritional Sciences, Master of Sciences (MS) Food and Nutritional Sciences | Whether you're interested in Food and Nutrition Sciences as a pre-medicine discipline, as preparation for a career in food science, including advanced opportunities in research or food industries, the rigorous coursework and expectations of our undergraduate and master's programs can help you achieve your goals. QUICK INFO Our graduates go on to work for public agencies, as registered dietitians, in food chemistry and food production development, food safety and inspection, college and communtiy instruction and many more rewarding fields. View Program Page College of Science and Technology Geomatics Bachelor of Sciences (BS) Geomatics | Only one university in North Carolina offers a four-year degree in geomatics leading to professional licensure, and it is ours, here at North Carolina A&T. This scientific discipline involves the use of measurements to determine locationos on the earth's surface. It is used in such work as urban planning and land use management, in-car navigation systems, transport network planning and much more. QUICK INFO Our graduates go on to careers in such fields as construction, boundary or hydrographic surveyor, global information system (GIS) analyst, drone operator, geodesist and many more. Geomatics can also prepare students for advanced studies in civil engineering and other engineering-related fields. View Program Page Online Degree College of Science and Technology Graphic Design Technology Bachelor of Sciences (BS) Graphic Design Technology | The technology and skill sets behind some of the most popular and widely used digital and web-based applications today -- video games, web sites, streaming video -- lie at the heart of the Graphic Design Technology degree. Our faculty will impart the knowledge and hands-on experience critical to both immediate and long-term success in this exciting and expanding field. QUICK INFO Our program is the only one of its kind in the Piedmont-Triad region that incorporates both design and technology management, and that means our graduates are in high demand by video game companies, design and communications firms, governmental agencies and more, with significant opportunities for advancement over the life of their careers. View Program Page College of Arts, Humanities and Social Sciences History Bachelor of Sciences (BS) History, Bachelor of Arts (BA) History, Master of Arts in Teaching (MAT) History | A keen understanding of the past can be the best tool to making sense of the present. To achieve that, our students become stronger critical thinkers, capable scholarly researchers and effective written and oral communicators -- skills that prepare them for success in a wide range of related fields and graduate programs. QUICK INFO Our graduates go on to beome high school history teachers or college history faculty, government historians, political advisors, archivists and more. A history degree can also prepare you for law school or other graduate studies in such disciplines as library science and museum science. View Program Page College of Agriculture and Environmental Sciences Human Lactation Certificate The Human Lactation Pathway 2 Program at N.C. A&T prepares individuals to become International Board Certified Lactation Consultants (IBCLCs), healthcare professionals who specialize in the clinical management of breastfeeding. To be eligible to take the IBCLC examination, an individual must complete one of three pathways. Pathway 2 requires completion of a comprehensive, accredited academic program in human lactation. QUICK INFO entered around community, diversity and equity, N.C. A&T’s P2P sets itself apart from other Pathway 2 programs by exceeding the number of didactic hours in the subject of communication set forth by the International Board of Lactation Consultant Examiners . More Info College of Engineering Industrial and Systems Engineering Bachelor of Sciences (BS) Industrial and Systems Engineering, Master of Sciences (MS) Industrial and Systems Engineering, PhD | A challenging program at one of the nation's best colleges of engineering, Industrial and Systems Engineering (ISE) aims big, preparing outstanding graduates and focusing on complex, global challenges. QUICK INFO A discipline that traces its roots to the Industrial Revolution, IES today includes a wide variety of occupational areas ranging from manufacturing to health care institutions. Our outstanding faculty and academic advisors will help ensure that whatever career focus you choose, you'll be fully prepared for impact in the workplace. View Program Page Online Degree Program Page College of Science and Technology Information Technology Bachelor of Sciences (BS) Information Technology, Master of Sciences (MS) Information Technology | No career field is growing faster today than Information Technology (IT), and our undergraduate and graduate degree programs, offered both on campus and online, prepare students for sucess in the wide range of IT positions. As a student, you'll gain a strong understanding of critical topics ranging from computer networking to database management to wireless communication. QUICK INFO Career opportunities open to our graduates include IT project manager, web designer, network engineer, database developer, IT consultant, big data engineer and more. Earning potential across these fields is strong at the entry-level with significant growth potential over the course of a career. MS Information Technology Online BS Information Technology Information Technology Minor College of Agriculture and Environmental Sciences Interdisciplinary Environmental Certificate Program The Interdisciplinary Environmental Certificate Program is designed to provide students with in-depth knowledge to develop innovative and creative solutions to improve and sustain the environment. There are two online certificate concentrations: the Post-Baccalaureate Interdisciplinary Environmental Justice Certificate (IEJC) and the Post-Baccalaureate Interdisciplinary Environmental Health and Safety Certificate (IEHC). View On-Campus Program View Online Program View More Information College of Agriculture and Environmental Sciences Interdisciplinary Environmental Certificate Program (IECP) This interdisclinary program offers four post-baccalaureate certificates designed to train students with in-depth knowledge to develop innovative and creative solutions to improve and sustain the environment. Graduate Certificates Offered: Environmental Engineering, Environmental Sciences, Environmental Justice, and Environmental Health and Safety. View More Info College of Agriculture and Environmental Sciences International Agricultural Development and Engagement The graduate certificate focuses on international trade issues, policy analysis techniques; project management, monitoring, and evaluation; techniques for solving complex problems involving multiple stakeholders; and behavior and culture in work organizations. As a result of the coursework, research, and experiential learning opportunities (domestically and abroad), graduates of the program will qualify for positions as mid-level personnel at the USDA Foreign Agricultural Services’ missions globally; trade coordinators for international corporations, including Cargill, Archer Daniels’ Midlands (ADM), Syngenta, Phillip Morris, and others. QUICK INFO The Graduate Certificate in International Agricultural Development and Engagement provides traditional and non-traditional students interested in agricultural development with the requisite knowledge and skills that will enable them to secure employment and effectively work across cultural boundaries. Certificate Information Online Certificate Program Page College of Arts, Humanities and Social Sciences Journalism and Mass Communication Bachelor of Sciences (BS) Journalism and Mass Communication | The media and communication industry is evolving quickly. Students looking to be part of this exciting, rewarding field will not only find outstanding preparation in the abiding basics, but up-to-the-minute preparation for current and emerging careers. QUICK INFO Whether your interests lie in public relations, digital and multimedia journalism or mass media production, we have programs that have launched thousands of incredible careers and that can do the same for you. College of Health and Human Sciences Kinesiology Bachelor of Sciences (BS) Kinesiology | The Department of Kinesiology is home to one of the university's most popular majors: The B.S. degree in Sport Science and Fitness Management. If you're interested in a career in sports, fitness, training or recreation fields, you'll find expert preparation for success in this major. QUICK INFO The opportunities within this program are surprisingly wide-ranging, from fitness specialist in a cardiac rehabilitation program to pharmaceutical sales to wellness instructor. Find out more today. College of Agriculture and Environmental Sciences Laboratory Animal Science Bachelor of Sciences (BS) Laboratory Animal Science | Our bachelor’s program is the degree of choice for students interested in pursuing pre-vet and pre-med paths and preparing for advanced studies in human and animal health-related areas. We also offer animal technician certification at three levels offered by the American Association of Laboratory Animal Science (AALAS). QUICK INFO Graduates of our program are equipped not only in technical skills, but also leadership skills in the area of animal welfare. College of Agriculture and Environmental Sciences Landscape Architecture Bachelor of Sciences (BS) Landscape Architecture | Our bachelor’s program has produced more African American landscape architects than any other program in the country, expanding diversity within the profession. Our students are trained in the social and geographical context of the field, and participate in service-based learning projects focused on underrepresented populations in the rural, urban and suburban South. QUICK INFO Our graduates are prepared to become leaders in the field and are provided with theoretical, technical and life skills necessary to address complex and consistent changes with respect to ecological and social challenges associated with design, conservation and landscape management. College of Education Leadership Studies PhD | Are you a leader within your organization interested in preparing yourself for the critical next step in your career? A&T's interdisciplinary Leadership Studies doctoral degree can provide the knowledge and preparation to support your aspirations. Our alumni have gone on to success and impact as college presidents, deans of schools and colleges, vice presidents of programs in education, health, non-profit organizations, business organizations and more. Program Information Online Degree College of Arts, Humanities and Social Sciences Liberal Studies Bachelor of Arts (BA) Liberal Studies | This interdisciplinary program is what people mean when they extoll the virtues of a great liberal arts education. Our broad, rigorous program prepares our students for impactful careers in a marketplace increasingly in search of liberal arts graduates and for success in graduate programs. Quick Info Liberal Studies students choose from one of four concentrations as a focus for their program, including African-American Studies, Applied Cultural Thought, Interdisciplinary Studies or Pre-Law. A Liberal Studies degree is available both on campus and online. View Program Page Online African American Studies Concentration Online Applied Cultural Thought Concentration College of Business and Economics Management Bachelor of Sciences (BS) Management | Management majors must be highly motivated, strategic and visionary thinkers with strong analytical, communication and interpersonal skills. Courses in accounting, finance, marketing, organizational behavior, production management, international management, and human resources management are program requirements. QUICK INFO A number of exciting career opportunities await the graduates from the Department of Management. Management graduates may consider careers in information systems, general management, human resources management, production and operations management, and entrepreneurship. A variety of business, government, and non-profit organizations regularly recruit majors through the Office of Career Services and Experiential Learning. View Program Page College of Business and Economics Management (Business Administration) Bachelor of Sciences (BS) Management (Business Administration) | Management majors must be highly motivated, strategic and visionary thinkers with strong analytical, communication and interpersonal skills. Courses in accounting, finance, marketing, organizational behavior, production management, international management, and human resources management are program requirements. QUICK INFO A number of exciting career opportunities await the graduates from the Department of Management. Management graduates may consider careers in information systems, general management, human resources management, production and operations management, and entrepreneurship. A variety of business, government, and non-profit organizations regularly recruit majors through the Office of Career Services and Experiential Learning. View Program Page College of Business and Economics Management (Management Information Systems) Bachelor of Sciences (BS) Management (Management Information Systems) | The MIS concentration prepares students for roles that involve analyses of computers and programs used by a company and determine which upgrades and installations will make employees and processes more productive. Graduates can perform cost/benefit analyses and align technology with a company’s business strategies and goals. They also help to translate requests from management and employees to solutions that can be achieved through technology changes and improvements. Students can choose to gain more expertise in areas like security, application development, business analytics, and enterprise applications, if they choose to do so. The broad-based skill set of the graduates makes them suitable for a variety of roles in management of IT like Business Analyst and roles in other related IT areas. The MIS concentration provides an opportunity for students to learn about the types of information systems utilized in organizations as well as how they can be managed to effectively support and streamline processes and strategy. This concentration is only offered on campus. QUICK INFO MIS graduates solve strategic business problems, analyze business processes, manage IT projects, and design information systems to support the strategies and operations of their employers. Consulting, healthcare, technology, and finance are just some of the many industries MIS graduates can enter. In fact, every type of organization in every type of industry hires MIS graduates. View Program Page College of Business and Economics Marketing Bachelor of Sciences (BS) Marketing | Marketing is the management of processes responsible for identifying, anticipating, & satisfying customer requirements profitably. It covers all the processes involved in successfully promoting and selling a product or service. QUICK INFO Our graduates are prepared for leadership. They are chosen for internships and permanent placements by the nation’s best-in-class corporations and public sector institutions. Some choose to continue their education at some of the most prestigious graduate schools and law schools in the nation. No matter the choice, MSCM alums have amassed impressive records of success. View Program Page College of Business and Economics Marketing ( Professional Sales) Bachelor of Sciences (BS) Marketing ( Professional Sales) | Marketing is the management of processes responsible for identifying, anticipating, & satisfying customer requirements profitably. It covers all the processes involved in successfully promoting and selling a product or service. QUICK INFO Our graduates are prepared for leadership. They are chosen for internships and permanent placements by the nation’s best-in-class corporations and public sector institutions. Some choose to continue their education at some of the most prestigious graduate schools and law schools in the nation. No matter the choice, MSCM alums have amassed impressive records of success. View Program Page College of Education Marriage Family Counseling Certificate, PB Available only as an add-on certificate to students admitted to the MS in Mental Health Counseling program at North Carolina A&T State University. View Program Page College of Science and Technology Mathematics Bachelor of Sciences (BS) Mathematics, Master of Sciences (MS) Mathematics | Our students can select from programs offering instruction in applied mathematics, pure mathematics, statistics and mathematics education. We also offer a master’s program that focuses on applied mathematics training, giving our scholars thorough background and research training in the area. QUICK INFO Our students are prepared through hands-on experience and with computational skills to tackle real-world challenges. Graduates are hired by financial consulting firms, banking institutions, biomedical and imaging enterprises and engineering and computer companies. Those pursuing mathematics education are well equipped to succeed in preparing young minds in the classroom. View Program Page College of Engineering Mechanical Engineering Bachelor of Sciences (BS) Mechanical Engineering, Master of Sciences (MS) Mechanical Engineering, PhD | If you're considering studying engineering, you could make no more impactful a choice then choosing Mechanical Engineering at North Carolina A&T, a nationally ranked engineering program and producer of more African American engineers than any university in America. QUICK INFO Mechanical engineers can pursue a wide variety of specializations in such areas as materials science, aerospace engineering, product design and manufacturing and many more. Our programs span the undergraduate, masters and doctoral levels and include both an honors program and an aerospace option. View Program Page College of Education Mental Health Counseling Master of Sciences (MS) Mental Health Counseling | Our master’s programs offers training in mental health counseling with a focus on either clinical or rehabilitation studies. The clinical program is accredited by the Council for the Accreditation of Educator Preparation (CAEP), and our rehabilitation program is accredited by the Council for Accreditation of Counseling and Related Educational Programs (CACREP). QUICK INFO Graduates of our clinical program often work in such settings as marriage and family counseling, substance abuse counseling and college counseling. Our rehabilitation program equips students to work in private practice, nonprofit agencies and correctional facilities and prepares them to pursue doctoral programs, if they so choose. View Program Page Joint School of Nanoscience and Nanoengineering Micro and Nano Devices Program Type: Post-Baccalaureate Certificate The purpose of this certificate program is to train and educate students from around the country in concepts related to the design of micro and nano, understanding their properties, and the knowledge needed to correlate these properties to their function. The education and training gained by the students will provide them with the skills needed to acquire employment opportunities in various industries, including medical, healthcare, pharmaceutical, electronics, automotive, and aerospace industries. It will also prepare them for careers in government agencies and advanced graduate studies in science, technology, and engineering. View Program Page College of Arts, Humanities and Social Sciences Music Bachelor of Arts (BA) Music | Our acclaimed bachelor’s programs offer degrees in general music, music performance and music education. We are accredited by the National Association of Schools of Music (NASM). QUICK INFO Upon graduation, our students earn their place in competitive graduate schools or are equipped to pursue fulfilling professional careers related to their focus areas. View Program Page Joint School of Nanoscience and Nanoengineering Nanoengineering Master of Sciences (MS) Nanoengineering, PhD | The master’s and doctoral programs offered by the Joint School of Nanoscience and Nanoengineering are uniquely positioned to cater to the needs of scholars from diverse science and engineering backgrounds. Our state-of-the-art research facility attracts students interested in conducting advanced research at the nanometer scale. QUICK INFO Graduates of our interdisciplinary program are prepared for positions in industry, government and academia in fields that utilize nanotechnology. View Program Page College of Health and Human Sciences Nursing Bachelor of Sciences (BS) Nursing | In the growing and dynamic field of health care, Nursing is among the most in-demand jobs, with possibilities for employment and advancement throughout North Carolina and across the country. North Carolina A&T's 65-year history of nursing education makes our university the right place to start your journey toward a rewarding career in this noble profession. Quick Info Whether you are interested in the traditional BSN degree, an accelerated BSN or building upon your associates degree by completing a bachelor's degree, the School of Nursing has the program that's right for you. ABSN Entry Option BSN Completion Online College of Science and Technology Occupational Safety and Health Students interested in managing occupational safety and health programs will find their match in this online certificate program. This growing field focuses on the mitigation of workplace risks, hazards and accidents. QUICK INFO A range of career opportunities map to this certificate program, including occupational health and safety technician, industrial hygiene manager consumer safety specialist, safety and health specialist and more. View Program Page College of Science and Technology Physics Bachelor of Sciences (BS) Physics, Master of Sciences (MS) Physics | The Department of Physics provides highly competitive graduate and undergraduate education in physics, in order to produce able and capable physicists who are trained in the art of critical thinking, problem solving, independent learning and practical skills to meet the technical and scientific challenges in state and federal government, industry and academia and the growing demands of interdisciplinary research. QUICK INFO The Department of Physics is committed to be a place of excellence in education, research and community service, and to achieve national recognition, distinction and preeminence. It aims at positioning itself to play a critical and leading role in building a research-intensive Interdisciplinary University. View Program Page College of Arts, Humanities and Social Sciences Political Science Bachelor of Arts (BA) Political Science | Understanding governments, politics and policies is one of the great challenges of our time. Students interested in political science will find in our program deeper insight through examination of political theory, American government, elections, social transformation and more. QUICK INFO A political science degree can open career doors in such fields as policy analyst, political consultant, legislative assistance, intelligence analyst and more. It can also serve as a sound undergraduate platform from which to pursue a graduate degree in Law or other disciplines. View Program Page College of Arts, Humanities and Social Sciences Professional Theatre Bachelor of Arts (BA) Professional Theatre | Our Bachelor of Fine Arts in Theatre program is one of only two offered by Historically Black Colleges and Universities in the country and is accredited by the National Association of Schools of Theatre (NAST). Black Broadway nationally ranked our program as one of the top five for African American students. QUICK INFO The Professional Theatre program encourages self-expression, awareness and discipline and prepares students for a successful and fulfilling career. Our students have won numerous regional and national awards at the Kennedy Center American College Theatre Festival before graduating and continuing to achieve amazing things on stage and behind the scenes. View Program Page College of Health and Human Sciences Psychology Bachelor of Arts (BA) Psychology | Our undergraduate degree in psychology introduces students to relevant ideas and concepts, interdisciplinary learning and offers training in both basic and applied research. QUICK INFO Graduates of our program are trained to succeed in any number of career paths including roles in crisis prevention counseling, substance abuse counseling and human resources. View Program Page College of Education Reading Education Master of Arts in Education (MAED) Reading Education | Our master’s degree in Reading Education prepares current “A” licensed classroom teachers as they work with students to improve literacy skills. Our program aligns with standards established by the International Literacy Association and North Carolina Department of Public Instruction. QUICK INFO Graduates of our program continue rewarding careers in education as teachers in public, private and charter schools as reading specialists, literacy coaches, special education program specialists, curriculum facilitators and more. MAED in Reading Education Online MAED -Reading (K-12) College of Education Rehabilitation Counseling and Behavioral Addictions The Certificate in Rehabilitation Counseling and Behavioral Addictions (RCBA) imparts specific knowledge and skills to its students that are required to effectively assist and counsel those who are impacted by behavioral addictions (i.e., alcohol and drugs, sexual addiction, eating disorders, criminal behaviors, and gambling). The specific emphasis on ethnic minorities serves to address the unique needs of these individuals, which may be overlooked or misunderstood during the treatment process. QUICK INFO The RCBA Certificate has been approved by the North Carolina Substance Abuse Professional Practice Board (NCSAPPB) and meets the reduction in NCSAPPB requirements for the Licensed Clinical Addictions Specialist credential. View Program Page College of Education Rehabilitation Psychology and Behavioral Medicine Certificate, PB The Certificate Program in Rehabilitation Psychology and Behavioral Medicine prepares counselors who focus on the application of psychological knowledge and skills on behalf of individuals with disabilities and chronic health conditions in order to maximize health and welfare, independence, and functional abilities. The certificate also prepares specialists who are concerned with behavioral approaches relevant to the understanding of physical health and illness, and the application of disease prevention, health promotion, treatment, and rehabilitation. View Program Page College of Education School Administration Master of Science in Administration (MSA) School Administration | The Master of School Administration degree prepares students who desire to transform marginalized communities by creating educational environments that cater to specific needs. QUICK INFO The MSA program produces culturally responsive leaders who often serve as superintendents, central office administrators, principals and assistant principals, among other high-impact positions. We are accredited by the Southern Association of Colleges and School (SACS), American Association of Colleges for Teacher Education and the American Council on Education. . View Program Page College of Education School Administration Certificate, PB View Program Page College of Education School Counseling Master of Sciences (MS) School Counseling | Our master’s program provides flexibility for students seeking a professional career in elementary or secondary school counseling by offering high caliber evening classes. We are nationally accredited by the Council for Accreditation of Counseling and Related Educational Programs (CACREP). QUICK INFO Graduates of our program are equipped to be dynamic school counselors, keeping the ethical standards established by the American Counseling Association (ACA) close to heart. They are essential in helping meet the academic, personal and social needs of individuals in school and community environments. View Program Page College of Science and Technology Secondary Education (Biology Education) Bachelor of Sciences (BS) Secondary Education (Biology Education) | We are dedicated to providing undergraduate students with academic coursework that challenges them to achieve to their fullest and prepares them to excel in today's classrooms. Biology Education is of special need today, with the heightened emphasis on STEM disciplines, meaning graduates of this program will have multiple options for employment. QUICK INFO Our highly-motivated students have a variety of opportunities available to them after graduating from our program. Some may pursue graduate and professional programs, while others may secure research careers in government and industry-related fields, including pharmaceutical sales, biotechnology and environmental science. View Program Page College of Health and Human Sciences Social Work Bachelor of Sciences (BS) Social Work | Our bachelor’s program strategically engages and mentors learners as they develop informed and responsible ways to address social change locally and globally. We are nationally accredited by the Council on Social Work Education (CSWE). QUICK INFO Our graduates develop competencies that lead to career placement in a number of fields, including advocacy services, social justice organizations, nonprofits and mental health agencies. Our social workers improve the quality of life of clients and skillfully perform interventions through research, policy, and community organizing. View Program Page College of Health and Human Sciences Social Work (Joint with UNCG) , PhD | This unique program jointly offered by N.C. A&T and UNCG prepares master’s and doctoral students for multicultural clinical practice as members of both campus communities. We are nationally accredited by the Council of Social Work Education (CSWE). QUICK INFO Graduates are prepared to collaborate with consumers and colleagues in the development of practices promoting social and economic justice. View Program Page College of Health and Human Sciences Sociology Bachelor of Arts (BA) Sociology | We train our undergraduates to investigate, identify and report on the ways social forces interact and impact our lives. Our program provides students with a diverse set of skills that help facilitate positive social change. QUICK INFO A degree in sociology from N.C. A&T prepares students for graduate study in law, social work and public administration. Additionally, many graduates matriculate into government service positions, applied research and other educational opportunities. View Program Page College of Health and Human Sciences Speech Bachelor of Arts (BA) Speech | The Department of Administration and Instructional Services encourages student exploration in two degree programs: Communication Studies and Speech/Language Pathology and Audiology. QUICK INFO A degree in Speech Communication Studies prepares graduates to pursue advanced degrees, become researchers, educators, advocates and business communication leaders. A degree in Speech/Language Pathology and Audiology also equips graduates to obtain a master’s degree that will open the door to employment in clinics, schools, hospitals and government agencies. View Program Page Joint School of Nanoscience and Nanoengineering STEM Entrepreneurship Program Type: Post-Baccalaureate Certificate The certificate in STEM Entrepreneurship is a program for any student who has an interest in learning how to establish or operate a business based on research and development in a STEM discipline. The certificate is open to any students who are interested in furthering their knowledge on technology transfer, commercialization, intellectual property, laws governing IP, marketing, and entrepreneurship. View Program Information College of Business and Economics Supply Chain Management Bachelor of Sciences (BS) Supply Chain Management | Our Marketing and Supply Chain department is accredited by the Association to Advance Collegiate Schools of Business (AACSB) and provides undergraduate students with a rigorous course of study that allows them to learn and apply essential elements related to supply chain analysis, international logistics and customer relationships and more. QUICK INFO Upon completion of the bachelor’s degree program, students are empowered to take on leadership positions with the nation’s best-in-class corporations and public sector institutions. View Program Page Joint School of Nanoscience and Nanoengineering Systems and Synthetic Biology Program Type: Post-Baccalaureate Certificate The Graduate Certificate program in Systems and Synthetic Biology is an interdisciplinary program that combines concepts from the life sciences, computing, and engineering fields and requires a converging technologies training approach. The field of systems and synthetic biology is expected to be a $5 Billion industry within the next decade. This program aims to train and educate students to prepare for research and careers in this field. View Program Information College of Education Teaching Master of Arts in Teaching (MAT) Teaching | Our master’s program is designed for individuals who desire to attain an initial teaching license in a specific concentration. QUICK INFO We offer 12 different discipline areas, including biology education, business education, child development and family consumer sciences. Our program is a proven route to classroom success for prospective teachers looking to make a difference in our schools and in the world. View Program Page Online Degree The Graduate College Technology Education Master of Arts in Teaching (MAT) Technology Education | Our online master’s program prepares rising leaders in the classroom and enhances their ability to deliver high quality technology, engineering and design education to students they engage with in public schools. We comply with the INTASC, CAEP and the North Carolina Department of Public Instruction, as well as the standards of achievement for 21st century learners. QUICK INFO This program is part of an NCATE accredited unit and graduates apply knowledge gained from respective research areas to their classroom interactions, including parental involvement, curriculum integration and student learning. View Program Page Online Degree College of Science and Technology Technology Management Master of Sciences (MS) Technology Management | We pride ourselves on offering an online master’s degree program that challenges and prepares future leaders of high-tech companies, while allowing room for flexibility and convenience. The program prepares you to develop science, technical, and business skills required for management of people and systems in technology-based industries, government agencies, and non-profit organizations. QUICK INFO Graduates of this program play leadership roles involving technology innovation, development and deployment of new technologies across a broad spectrum of industries, and decision-making to improve business performance . Some grads pursue supervisory roles, while others continue on the academic track to earn a Ph.D. in Technology Management or other disciplines. We also offer Ph.D. in Applied Science and Technology with Technology Management concentration. View Program Page Online Degree College of Arts, Humanities and Social Sciences Visual Arts, Design Bachelor of Arts (BA) Visual Arts, Design | The Visual Arts, Design degree allows students to take rigorous studio courses in drawing, design, color theory, computer graphic design, painting and art history. Upon graduation, you will have a developed portfolio that demonstrates immense skill in both traditional and new media. QUICK INFO Our program prepares students for an ever-changing and expanding landscape. We prepare students to meet the demand of the new standards in visual arts communications. View Program Page College of Education Vocational Evaluation and Work Adjustment Certificate, PB The Certificate in Vocational Evaluation and Work Adjustment (VEWA) prepares students to administer, score, and interpret a variety of Psychological, Cognitive, Intelligence, Aptitude, and Career tests, especially for persons with disabilities. The certificate also prepares specialists who focus on pre-employment and employment skill development along with reintegrating persons with disabilities into the community. The VEWA program prepares students to become board eligible to obtain national certification as a Professional Vocational Evaluator (PVE). View Program Page Accounting College of Business and Economics BS, MBA | Adult Education College of Education MS | Advanced Certification in Family and Consumer Sciences College of Agriculture and Environmental Sciences Advanced Materials Joint School of Nanoscience and Nanoengineering Advanced Waste Management Certificate College of Agriculture and Environmental Sciences Agricultural and Environmental Sciences College of Agriculture and Environmental Sciences PhD | Agricultural and Environmental Systems College of Agriculture and Environmental Sciences BS, MS | Agricultural Education College of Agriculture and Environmental Sciences BS, MS | Animal Science College of Agriculture and Environmental Sciences BS | Applied Engineering Technology College of Science and Technology BS | Applied Mathematics College of Science and Technology MS | Applied Science and Technology College of Science and Technology PhD | Atmospheric Sciences and Meteorology College of Science and Technology BS | Automotive Engineering Technology College of Science and Technology BS | Bioengineering College of Engineering BS, MS | Biological Engineering College of Agriculture and Environmental Sciences BS | Biology College of Science and Technology BS, MS, MAT | Built Environment College of Science and Technology BS | Business Administration College of Business and Economics MBA | Business Analytics College of Business and Economics BS | Business Information Technology College of Business and Economics BS | Chemical Engineering College of Engineering BS, MS | Chemistry College of Science and Technology BS, MS | Child Development and Family Studies College of Agriculture and Environmental Sciences BS | Civil, Architectural and Environmental Engineering College of Engineering BS, MS | Computational Data Science and Engineering College of Engineering MS, PhD | Computer Engineering College of Engineering BS | Computer Science College of Engineering BS, MS, PhD | Construction Management College of Science and Technology BS | Counselor Education and Supervision College of Education PhD | Criminal Justice College of Arts, Humanities and Social Sciences BS | Cybersecurity College of Engineering MS | Post-Baccalaureate Certificate in Data Analytics College of Science and Technology Post-Baccalaureate Certificate in Data-Driven Modeling and Analysis of Complex Systems College of Engineering Economics College of Business and Economics BS | Electrical Engineering College of Engineering BS, MS | Electronics Technology College of Science and Technology BS | Elementary Education and Special Education College of Education BS, MAT, MAED | English College of Arts, Humanities and Social Sciences BA, MA, MAT | English and African American Literature College of Arts, Humanities and Social Sciences MA | Environmental Health and Safety College of Science and Technology BS | Family and Consumer Science College of Education BS, MAT | Family Financial Planning College of Agriculture and Environmental Sciences Finance College of Business and Economics BS | Food and Nutritional Sciences College of Agriculture and Environmental Sciences BS, MS | Geomatics College of Science and Technology BS | Graphic Design Technology College of Science and Technology BS | History College of Arts, Humanities and Social Sciences BS, BA, MAT | Human Lactation Certificate College of Agriculture and Environmental Sciences Industrial and Systems Engineering College of Engineering BS, MS, PhD | Information Technology College of Science and Technology BS, MS | Interdisciplinary Environmental Certificate Program College of Agriculture and Environmental Sciences Interdisciplinary Environmental Certificate Program (IECP) College of Agriculture and Environmental Sciences International Agricultural Development and Engagement College of Agriculture and Environmental Sciences Journalism and Mass Communication College of Arts, Humanities and Social Sciences BS | Kinesiology College of Health and Human Sciences BS | Laboratory Animal Science College of Agriculture and Environmental Sciences BS | Landscape Architecture College of Agriculture and Environmental Sciences BS | Leadership Studies College of Education PhD | Liberal Studies College of Arts, Humanities and Social Sciences BA | Management College of Business and Economics BS | Management (Business Administration) College of Business and Economics BS | Management (Management Information Systems) College of Business and Economics BS | Marketing College of Business and Economics BS | Marketing ( Professional Sales) College of Business and Economics BS | Marriage Family Counseling Certificate, PB College of Education Mathematics College of Science and Technology BS, MS | Mechanical Engineering College of Engineering BS, MS, PhD | Mental Health Counseling College of Education MS | Micro and Nano Devices Joint School of Nanoscience and Nanoengineering Music College of Arts, Humanities and Social Sciences BA | Nanoengineering Joint School of Nanoscience and Nanoengineering MS, PhD | Nursing College of Health and Human Sciences BSN | Occupational Safety and Health College of Science and Technology Physics College of Science and Technology BS, MS | Political Science College of Arts, Humanities and Social Sciences BA | Professional Theatre College of Arts, Humanities and Social Sciences BA | Psychology College of Health and Human Sciences BA | Reading Education College of Education MAED | Rehabilitation Counseling and Behavioral Addictions College of Education Rehabilitation Psychology and Behavioral Medicine Certificate, PB College of Education School Administration College of Education MSA | School Administration Certificate, PB College of Education School Counseling College of Education MS | Secondary Education (Biology Education) College of Science and Technology BS | Social Work College of Health and Human Sciences BS | Social Work (Joint with UNCG) College of Health and Human Sciences MSW, PhD | Sociology College of Health and Human Sciences BA | Speech College of Health and Human Sciences BA | STEM Entrepreneurship Joint School of Nanoscience and Nanoengineering Supply Chain Management College of Business and Economics BS | Systems and Synthetic Biology Joint School of Nanoscience and Nanoengineering Teaching College of Education MAT | Technology Education The Graduate College MAT | Technology Management College of Science and Technology MS | Visual Arts, Design College of Arts, Humanities and Social Sciences BA | Vocational Evaluation and Work Adjustment Certificate, PB College of Education Back to Top © 2024 N.C. A&T 1601 E. Market Street, Greensboro, NC 27411 | 336.334.7500 Mission Legal / Title IX Employment Privacy Policy Contact Us Site Map Facebook Twitter Instagram YouTube /**/ (function() { var sz = document.createElement('script'); sz.type = 'text/javascript'; sz.async = true; sz.src = '//us1.siteimprove.com/js/siteanalyze_31565.js'; var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(sz, s); })(); /**/ /**/ adroll_adv_id = \"5WCSNKBJ4NDJJN6A5TWLC2\"; adroll_pix_id = \"CQHCPMVX7RGELE4SVDRVGV\"; (function () { var _onload = function(){ if (document.readyState && !/loaded|complete/.test(document.readyState)){setTimeout(_onload, 10);return} if (!window.__adroll_loaded){__adroll_loaded=true;setTimeout(_onload, 50);return} var scr = document.createElement(\"script\"); var host = ((\"https:\" == document.location.protocol) ? \"https://s.adroll.com\" : \"http://a.adroll.com\"); scr.setAttribute('async', 'true'); scr.type = \"text/javascript\"; scr.src = host + \"/j/roundtrip.js\"; ((document.getElementsByTagName('head') || [null])[0] || document.getElementsByTagName('script')[0].parentNode).appendChild(scr); }; if (window.addEventListener) {window.addEventListener('load', _onload, false);} else {window.attachEvent('onload', _onload)} }()); /**/ !function(e,n,u,a){e.twq||(a=e.twq=function(){a.exe?a.exe.apply(a,arguments): a.queue.push(arguments);},a.version='1',a.queue=[],t=n.createElement(u), t.async=!0,t.src='//static.ads-twitter.com/uwt.js',s=n.getElementsByTagName(u)[0], s.parentNode.insertBefore(t,s))}(window,document,'script'); // Insert Twitter Pixel ID and Standard Event data below twq('init','nvdcf'); twq('track','PageView'); window.dataLayer = window.dataLayer || []; function gtag(){dataLayer.push(arguments);} gtag('js', new Date()); gtag('config', 'G-CC39QMM3R1'); /**/ var _tvq = window._tvq = window._tvq || []; (function() { var u = ((\"https:\" == document.location.protocol) ? \"https://collector-16533.us.tvsquared.com/\" : \"http://collector-16533.us.tvsquared.com/\"); _tvq.push(['setSiteId', \"TV-8136456363-1\"]); _tvq.push(['setTrackerUrl', u + 'tv2track.php']); _tvq.push([function() { this.deleteCustomVariable(5, 'page') }]); _tvq.push(['trackPageView']); var d = document, g = d.createElement('script'), s = d.getElementsByTagName('script')[0]; g.type = 'text/javascript'; g.defer = true; g.async = true; g.src = u + 'tv2track.js'; s.parentNode.insertBefore(g, s); })(); /**/ var containerEl = document.querySelector('.programContainer'); var mixer = mixitup(containerEl, { multifilter: { enable: true }, animation: { effects: 'fade translateZ(-100px)' } });"}
]